export const ganttChart = {
    info: {
        title: 'Gantt Chart',
        sub: '테이블 생성 보조 웹 툴',
        since: '2022. 02. 16 ~ 2022. 02. 21',
        link: 'ganttChart',
    },
    line: {
        title: '테이블 생성 보조 웹 툴',
        desc: '순수 자바스크립트로 만들었으며, 기존에 테이블 조작에 불편함을 많이 느껴 UI로 쉽게 조정가능한 툴을 고안하여 제작했습니다.',
        subline: [
            '테이블 모든 속성 값 변경 자동화 (확장성 고려)',
            '드래그 선택 시 선택 박스 표시',
            '시트 사용으로 다양한 작업 저장',
            '로컬 스토리지를 사용한 데이터 저장',
            '작성한 테이블을 시트로 관리',
        ]
    }
}