export const mentees = {
    info: {
        order: 1,
        title: 'Mentees',
        sub: '1인 프로젝트',
        since: '2021. 09. 15 ~ 2021. 09. 28',
        link: 'mentees',
        important: true,
    },
    line: {
        title: '멘티들이 모여 만드는 성장 커뮤니티',
        desc: '멘토와 멘티의 연결을 위한 사이트가 많지만 멘티들이 서로 정보를 자유롭게 공유하고 함께 헤쳐나가며 함께 성장해 나가는 커뮤니티를 생각해보았습니다.',
        subline: [
            '멘티 추천으로 추천된 사람이 점수를 취득하는 시스템',
            '멘티스 프로그램을 누구나 등재 가능하며, 모집인원, 시작, 종료, 마감일을 설정',
            '서로 크리틱을 주고 받는 피드백 페이지 구현',
            '계층형 댓글 구현',
        ]
    }
}