export const eduList = [
  {
    info: {
      title: "현재",
      sub: "진행중",
      since: "2021. 03 ~",
    },
    line: {
      title:
        "노드 백엔드 개발자입니다. 모니터링과 네트워크, 버져닝에 관심이 많습니다.",
      desc: "넓은 개념에서 바라보는 시야를 가지기위해 노력합니다. 대량의 트래픽 처리와 부하 분산을 위한 서버 아키텍처를 구상하며, 현재는 보안과 네트워크를 관심있게 보고 있습니다.",
    },
  },
  {
    info: {
      title: "JAVA 1개월반 과정 수료",
      sub: "수료",
      since: "2021. 03",
    },
    line: {
      title: "JAVA JSP 수료",
      desc: "자바 1개월 반 과정을 거쳐 JSP로 기본적인 CRUD 구현을 익히고 웹 애플리케이션을 구축하는데 집중하여 과정을 이수",
    },
  },
  {
    info: {
      title: "한국국제대학교",
      sub: "졸업",
      since: "2018. 02",
    },
    line: {
      title: "실내건축학 학사 취득",
      desc: "건축에 뜻을 가지고 실내건축학을 전공하여 건축가 자격을 얻기 위해 조기취업하여 예비건축사시험 합격 및 LH 공공주택 설계공모 관련 실무 수행",
    },
  },
  {
    info: {
      title: "한국국제대학교",
      sub: "입학",
      since: "2013. 02.",
    },
    line: {
      title: "실내건축학 전공",
      desc: "건축에 뜻을 가지고 실내건축학을 전공하여 조기취업하여 LH 공공주택 설계공모관련 실무 수행",
    },
  },
];
