export const timeline = [
  {
    info: {
      title: "(주)프로젝트그룹 앤더",
      sub: "입사 - 퇴사",
      since: `2022. 09 ~ 2023-09`,
    },
    line: {
      title: "제작팀/BE",
      desc: "서버 환경구축과 DB설계, API 서버 제작 담당",
      subline: [
        "AWS 클라우드 서버 관리 | 인프라",
        "서버 부하 테스트 | 테스팅",
        "웹 화상 채팅 및 라이브커머스 서비스 제작 | 백앤드",
        "Socket 서버 구축 | 백앤드",
        "데이터베이스 이중화 | 백앤드",
        "백오피스 제작 | 프론트앤드",
        "기존 express 프레임워크에서 fastify 사용 제안 | 기술 제안",
      ],
    },
  },
  {
    info: {
      title: "(주)리본소프트",
      sub: "입사 - 퇴사",
      since: "2022. 05 ~ 2022. 07",
    },
    line: {
      title: "백엔드/블록체인",
      desc: "프로젝트 블록체인 환경 구축 보조 및 프론트 UI 생성 & 데이터베이스 연결",
      subline: [
        "NFTMarketplace blockchain 서버 연결 및 데이터베이스 연결 api 개발 | 서버 & 데이터베이스 연결",
        "WebRTC 개발을 위한 Janus library 소스코드 분석 | 소스코드 분석",
        "Web Media service를 위한 ffmpeg 기술 조사 및 영상편집 기술 개발 | 영상편집 기술 개발",
        "Web Media service를 위한 ffmpeg 기술 조사 및 영상편집 기술 개발 | 영상편집 기술 개발",
        "Metacrypto 환경 구축 보조 | metacrypto 보조",
      ],
    },
  },
  // {
  //   info: {
  //     title: "(주)대경건축사사무소",
  //     sub: "입사 - 퇴사",
  //     since: "2018. 01 ~ 2020. 09",
  //   },
  //   line: {
  //     title: "설계사무소 경력",
  //     desc: "LH APT 공모를 주로 진행하며 건축 설계 도면 작성, 도면 보고서 PM 담당",
  //     subline: [
  //       "종로창신, 안양석수 현상설계 | PM 및 도면 작성",
  //       "성남복정 A-3BL 현상설계 | PM 및 도면 작성",
  //       "의왕월암 A-1BL 현상설계 | PM 보조 및 도면 작성",
  //       "화성동탄2 트라이엠파크 | PM 보조 및 도면 작성",
  //       "남양주진접A8 / 철원 철원행복주택 | PM 보조 및 도면 작성",
  //       "창원명곡 A1-1BL 공동주택(신혼희망타운) 현상설계 | 도면작성 및 보고서 작성",
  //       "시흥장현 A-3BL 공동주택 현상설계 | 도면작성 및 보고서 작성",
  //       "부산기장 A2BL 시공책임형 CMR 아파트 건설공사 1공구 | 도면작성 및 보고서 작성",
  //       "부산명지 A5블록 공동주택 현상설계 | 도면작성 및 보고서 작성",
  //       "파주운정3 A26블록 공동주택 현상설계 | 도면작성 및 보고서 작성",
  //       "제6회 주택설계 기술경진대회 | 도면작성 및 보고서 작성",
  //       "파주운정 A-37블록 공동주택 현상설계 | 도면작성 및 보고서 작성",
  //       "남양주별내지구 A1-1BL 공동주택 현상설계 | 도면작성 및 보고서 작성",
  //       "(공공임대리츠)창원가포 S-1BL 아파트 건설공사 2공구 | 도면작성 및 보고서 작성",
  //       "서귀포성산지구 공동주택 현상설계 | 보고서 작성",
  //       "진주옥봉 행복주택 설계공모 | 보고서 작성",
  //     ],
  //   },
  // },
];
